<HTML>
<HEAD>
   <META HTTP-EQUIV="Content-Type" CONTENT="text/html; charset=iso-8859-1">
   <META NAME="Generator" CONTENT="Microsoft Word 97">
   <META NAME="Template" CONTENT="C:\ARCHIVOS DE PROGRAMA\MICROSOFT OFFICE\OFFICE\html.dot">
   <META NAME="GENERATOR" CONTENT="Mozilla/4.01 [en] (Win95; I) [Netscape]">
   <TITLE>Historia</TITLE>
</HEAD>
<BODY TEXT="#FFFF00" BGCOLOR="#3366FF" LINK="#33FF33" VLINK="#FFFF99" ALINK="#FFFFFF" BACKGROUND="Images/munieco.GIF" NOSAVE>

<CENTER><FONT COLOR="#FFFF00"><FONT SIZE=+4>Historia del Grupo</FONT></FONT></CENTER>

<CENTER></CENTER>

<CENTER><IMG SRC="Images/line.gif" HEIGHT=12 WIDTH=625></CENTER>
&nbsp;
<BR>&nbsp;
<TABLE BORDER COLS=1 WIDTH="100%" BGCOLOR="#000066" >
<TR>
<TD><B>Or&iacute;genes (91)</B>

<P>Miguel y Ronny, bajista y cantante del seminal grupo ovetense <I>"<B>Los
Abor&iacute;genes</B>", </I>no contentos con la direcci&oacute;n musical
tomada, deciden separar amistosamente el grupo y formar una nueva banda
por su cuenta m&aacute;s cerca del sonido <I>Detroit, </I>el <I>New York
noise</I> y el <I>garage Punk</I>. En la Escuela de Artes de Oviedo, donde
ambos estudiaban conocen a Javier Rodr&iacute;guez. Tras ponerle una canci&oacute;n
de "<I>Pussy Galore"</I> le preguntan si ser&iacute;a capaz de tocar as&iacute;i,
el cual contesta: "Esto est&aacute; tirado, es una escala pentat&oacute;nica
en...y blah, blah, blah...". Reclut&aacute;ndolo al momento. Al tener la
necesidad de un bater&iacute;a, echan mano de Labra, su viejo compa&ntilde;ero
de <I>"Los abor&iacute;genes".</I><I></I>

<P>Esta primera formaci&oacute;n ensaya durante seis meses antes de dar
su primer concierto en el Box de Gij&oacute;n el 15-6-91, logrando un relativo
&eacute;xito. Despu&eacute;s de dar otro par de conciertos, Miguel deja
el grupo no contento con la trayectoria tomada por &eacute;ste, m&aacute;s
cerca del <I>Punk Rock</I> que del <I>noise</I> planteado originalmente.&nbsp;

<P>De esta &eacute;poca queda como &uacute;nico documento una maqueta grabada
con la producci&oacute;n de Paco Loco en una 8 pistas en los bajos del
Campo de Futbol de Oviedo
<BR>
<HR WIDTH="100%">
<BR><B>Consolidaci&oacute;n (91-93)</B>

<P>Con la entrada de David Cantalejo (ex-<I>Qu&eacute; quies medalles</I>?)
en la banda, el grupo perfecciona su directo. Llegan a ofrecer m&aacute;s
de 100 conciertos. En el verano del 92 forman parte de una representaci&oacute;n
de artistas gijoneses en un intercambio cultural&nbsp; con Noirt, el cual
les permiti&oacute; dar 6 conciertos en Francia. Regresan cargados de confianza
en s&iacute; mismos y la buena racha persiste llegando a ganar un concurso
del Ayuntamiento de Pola de Siero.

<P>Carlos Subterfuge se interesa por el grupo tras enviarle una segunda
maqueta grabada con la producci&oacute;n de Carlos Loco en un 4 pistas
de su propiedad. Les edita una canci&oacute;n de dicha maqueta (<I>My little
Michael)</I> en el EP recopilatorio que regalaba con su Fanzine. Posteriormente
les ofrece editar un EP en su sello; Javi manda una maqueta del entonces
desconocido <I>Australian Blonde </I>con la idea de distribuir esfuerzos
compartiendo cada grupo una cara del mismo.&nbsp;

<P>En 1993, el grupo sufre un par&oacute;n debido al servicio militar de
Ronny. Durante el cual el resto de la banda aprovecha para ensayar y componer
por su cuenta nuevos temas que les sirven para llenar el CD "1993" que
To&ntilde;o Barral (Waco) les convence para grabar aprovecando los permisos
de Ronny.

<P>Con Ronny ya libre de compromisos con la patria, sale a la luz el CD
ofreciendo as&iacute; su primera gira por todo el pa&iacute;s. Agotan la
primera edici&oacute;n del mismo, no volvi&eacute;ndose a re-editar al
no estar el grupo contento con su sonido.

<P>Finaliza esta etapa con la grabaci&oacute;n del EP "Fan hasta la Muerte",
producto de la proposici&oacute;n de <I>Alberto Movie </I>(fan del grupo).
<BR>
<HR WIDTH="100%">
<BR><B>Renovaci&oacute;n (93-96)</B>

<P>El grupo inicia una nueva etapa con la incorporaci&oacute;n a la segunda
guitarra de <A HREF="Componentes.html">Juan Barreiro</A> un viejo conocido
que formaba parte de la <B><I>pe&ntilde;a Kactus. </I></B>Juan participa
en la gira de "Fan hasta la Muerte" que les lleva a una espiral et&iacute;lica
a la cual dicen basta tras un penoso concierto en La Felguera.&nbsp;

<P>Con esta formaci&oacute;n graban su segundo LP/CD "Supersex". En el
verano del 95 Labra abandona el grupo para dedicarse a su labor de profesor
y David hace lo propio para concentrarse en "<I>Los M&aacute;s Turbados</I>"&nbsp;
(con los que llevaba tocando una temporada).&nbsp;

<P>El grupo se replantea continuar, pero decide seguir con la incorporaci&oacute;n
de <I>Sergio Mori</I> al bajo y <I>Roberto Nicieza</I> a la Bater&iacute;a.
Con esta formaci&oacute;n sale a la calle en Marzo del 96 el "<I>Supersex
Tour EP</I>" grabado en directo en la gira de presentaci&oacute;n del CD
de igual nombre.

<P>Roberto Nicieza abandona la banda y se concentra en su labor en Astro
Records

<P>
<HR WIDTH="100%">
<BR>
<B> Etapa actual (desde el 96)</B>

<P>
Roberto Tana es el bater&iacute;a elegido para cubrir el puesto vacante.
Desde entonces, se dedican a cubrir los &uacute;ltimos compromisos en directo
y, sobre todo, a la composici&oacute;n de nuevas canciones con la intenci&oacute;n
de grabar el que ser&aacute; su tercer LP. El imprevisto cierre de
Waco Records retrasa el proyecto hasta que el grupo encuentre un nuevo
sello interesado. Para ello graban una maqueta con 6 temas nuevos que ofrecen
a varios sellos de los que reciben diversas ofertas.

<p> En 1998 graban con Astro Records el EP "Look at you" y el CD "Sound City". 
    Tras una gira de presentaci&oacute;n de este disco deciden separarse. 
    Ronny se dedica a su nuevo proyecto, 
    <a href="http://hey.to/mccoyson">The Real McCoyson</a>

</TD>
</TR>
</TABLE>
&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
<BR>&nbsp;
</BODY>
</HTML>
